

Internet-Draft                                    D. Mohan, Nortel
PWE3 Working Group                               N. Bitar, Verizon
Intended status: Standards Track          P. Niger, France Telecom
Expires: May 2008                                S. Delord, Uecomm

                                                     November 2007


              MPLS and Ethernet OAM Interworking
             draft-mohan-pwe3-mpls-eth-oam-iwk-00


Status of this Memo

By submitting this Internet-Draft, each author represents that any
applicable patent or other IPR claims of which he or she is aware
have been or will be disclosed, and any of which he or she becomes
aware will be disclosed, in accordance with Section 6 of BCP 79.

Internet-Drafts are working documents of the Internet Engineering
Task Force (IETF), its areas, and its working groups.  Note that
other groups may also distribute working documents as Internet-
Drafts.

Internet-Drafts are draft documents valid for a maximum of six months
and may be updated, replaced, or obsoleted by other documents at any
time.  It is inappropriate to use Internet-Drafts as reference
material or to cite them other than as "work in progress."

The list of current Internet-Drafts can be accessed at
http://www.ietf.org/ietf/1id-abstracts.txt.

The list of Internet-Draft Shadow Directories can be accessed at
http://www.ietf.org/shadow.html.

This Internet-Draft will expire in May 2008.


Copyright Notice

Copyright (C) The IETF Trust (2007).


Abstract

This document specifies the mapping of defect states between
Ethernet Attachment Circuits (ACs) and associated Ethernet
Pseudowires (PWs) connected in accordance to the PWE3 architecture
[RFC3985] to realize an end-to-end emulated Ethernet service. This
document augments the mapping of defect states between a PW and
associated AC of the end-to-end emulated service in [PW-OAM-MSG-
MAP]. In [PW-OAM-MSG-MAP], Ethernet OAM was not covered due to lack
of Ethernet OAM maturity. However, since then, [Y.1731] and


Mohan, et. al.         Expires: May 2008                   [Page 1]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

[802.1ag] have been both completed, and this document specifies the
mapping of defect states between Ethernet ACs and corresponding
Ethernet PWs.


Conventions used in this document

The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
"SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
document are to be interpreted as described in RFC 2119.


Table of Contents

Status of this Memo................................................1
Conventions used in this document..................................2
1. Introduction....................................................3
1.1. Reference Model and Defect Locations..........................3
1.2. Abstract Defect States........................................4
2. Terminology.....................................................5
3. PW Status and Defects...........................................5
3.1 Use of Native Service notification.............................6
3.2 Use of PW Status notification for MPLS PSNs....................6
3.3 Use of BFD Diagnostic Codes....................................7
4. Ethernet AC Defect States Entry or Exit Criteria................7
4.1 AC Forward Defect State Entry or Exit..........................7
4.2 AC Reverse Defect State Entry or Exit..........................8
5. Ethernet AC and PW Defect States Interworking...................8
5.1 PW Forward Defect Entry Procedures.............................8
5.2 PW Forward Defect Exit Procedures..............................9
5.3 PW Reverse Defect Entry Procedures............................10
5.4 PW Reverse Defect Exit Procedures.............................10
5.5 AC Forward Defect Entry Procedures............................10
5.6 AC Forward Defect Exit Procedures.............................11
5.7 AC Reverse Defect Entry Procedures............................11
5.8 AC Reverse Defect Exit Procedures.............................11
6. Acknowledgments................................................12
7. IANA Considerations............................................12
8. Security Considerations........................................12
9. References.....................................................12
9.1 Normative References..........................................12
9.2 Informative References........................................12
Appendix A: Ethernet Native Service Management....................13
Authors' Addresses................................................14
Full Copyright Statement..........................................14
Intellectual Property.............................................15




Mohan, et. al.         Expires: May 2008                   [Page 2]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

1. Introduction

This document specifies the mapping of defect states between
Ethernet Attachment Circuits (ACs) and associated Ethernet
Pseudowires (PWs) connected in accordance to the PWE3 architecture
[RFC3985] to realize an end-to-end emulated Ethernet service. This
document augments the mapping of defect states between a PW and
associated AC of the end-to-end emulated service in [PW-OAM-MSG-
MAP]. In [PW-OAM-MSG-MAP], Ethernet OAM was not covered due to lack
of Ethernet OAM maturity. However, since then, [Y.1731] and
[802.1ag] have been both completed, and this document specifies the
mapping of defect states between Ethernet ACs and corresponding
Ethernet PWs.

Native Service (NS) OAM may be transported transparently over the
corresponding PW as user data. For Ethernet, as an example, 802.1ag
continuity check messages (CCMs) between two Maintenance End Points
(MEPs) can be transported transparently as user data over the
corresponding PW. At MEP location, service failure is detected when
a number of consecutive CCMs are missed. MEP locations can be the
PE, the CE or both with different Maintenance Domain Levels.
However, when interworking two networking domains, such as native
Ethernet and PWs to provide an end-to-end emulated service, there is
need to identify the failure domain and location even when a PE
supports both the NS OAM mechanisms and the PW OAM mechanisms. In
addition, scalability constraints may not allow running proactive
monitoring, such as CCMs with transmission on, at a PE to detect the
failure of an Ethernet Virtual circuit (EVC) across the PW domain.
Thus, network driven alarms generated upon failure detection in the
NS or PW domain and their mappings to the other domain are needed.
There are also cases where a PE may not be able to process NS OAM
messages received on the PW even when such messages are defined, as
in Ethernet case, necessitating the need for fault notification
message mapping between the PW domain and the Client domain.

For Multi-Segment PWs (MS-PWs) [MS-PW-ARCH], Switching PEs (S-PEs)
are not aware of the NS. Thus failure detection and notification at
S-PEs will be based on PW OAM mechanisms. Mapping between PW OAM and
NS OAM will be required at the Terminating PEs (T-PEs) to propagate
the failure notification to the EVC endpoints.

Similar to [PW-OAM-MSG-MAP], the intent of this document is to
standardize the behavior of PEs with respect to failures on Ethernet
ACs and PWs, so that there is no ambiguity about the alarms
generated and consequent actions undertaken by PEs in response to
specific failure conditions.


1.1.          Reference Model and Defect Locations

Figure 1 is the same as used in [PW-OAM-MSG-MAP] and is reproduced
in this document as a reference to highlight defect locations.


Mohan, et. al.         Expires: May 2008                   [Page 3]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007



        ACs             PSN tunnel               ACs
               +----+                  +----+
+----+          | PE1|==================| PE2|          +----+
|    |---(a)---(b)..(c)......PW1..(d)..(c)..(f)---(e)---|    |
| CE1|   (N1)   |    |                  |    |    (N2)  |CE2 |
|    |----------|............PW2.............|----------|    |
+----+          |    |==================|    |          +----+
    ^          +----+                  +----+          ^
    |      Provider Edge 1         Provider Edge 2     |
    |                                                  |
    |<-------------- Emulated Service ---------------->|

Customer                                                Customer
Edge 1                                                  Edge 2

             Figure 1: PWE3 Network Defect Locations


1.2.          Abstract Defect States

Abstract Defect States are also introduced in [PW-OAM-MSG-MAP]. This
document uses the same conventions, as shown in Figure 2 from [PW-
OAM-MSG-MAP]. It may be noted however that CE devices, shown in
Figure 2, do not necessarily have to an end customer devices; these
are essentially devices in client network segments that are
connecting to PSN network for the emulated services.

                     +-----+
  ----AC forward---->|     |-----PW reverse---->
CE1                    | PE1 |                       PE2/CE2
  <---AC reverse-----|     |<----PW forward-----
                     +-----+

(arrows indicate direction of user traffic impacted by a defect)

Figure 2: Forward and Reverse Defect States and Notifications

PE1 may detect a forward defect in local Ethernet AC via one of the
following mechanisms:
- An AIS alarm generated at an upstream node in the client domain
(CE1 in Figure 2) and received on the local AC.
- Failure of the local link on which the AC is configured.
- Failure to receive CCMs on the AC if a local MEP is configured for
the AC.

AC forward defect impacts the ability of PE1 to receive user traffic
from the Client domain.

Similarly, PE1 may detect a forward defect in the PW via one of the
following mechanisms:


Mohan, et. al.         Expires: May 2008                   [Page 4]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

- Forward Defect indication received from PE2. This defect
indication could point to problems associated with PE2's inability
to transmit traffic on the PW or PE2's inability to receive traffic
on its local AC.
- Unavailability of a PSN path in the PW domain to PE2.

PW forward defect received on PE1 impacts the ability of PE1 to
receive traffic on the PW on the PSN side.

PE1 may be notified of an AC reverse defect via CCMs with RDI
(Remote Defect Indication) bit set. AC reverse defect impacts the
ability of PE1 to send user traffic on the local AC.

Similarly, PE1 may be notified of a PW reverse defect via Reverse
Defect indication from PE2, which could point to problems associated
with PE2's inability to receive traffic on the PW or PE2's inability
to transmit traffic on its local AC. PW reverse defect impacts PE1
ability of to send user traffic to CE2.

The procedures outlined in this document define the entry and exit
criteria for each of the four defect states with respect to Ethernet
ACs and corresponding PWs, and the consequent actions that PE1 must
support to properly interwork these defect states and corresponding
notification messages between the PW domain and the Native Service
(NS) domain. Forward defect state will have precedence over reverse
defect state in terms of handling, when both forward and reverse
defect states are identified simultaneously.


2. Terminology

This document uses the following terms.

AIS       Alarm Indication Signal
MD Level  Maintenance Domain (MD) Level which identifies a value
          in the range of 0-7 associated with Ethernet OAM frame.
          MD Level identifies the span of the Ethernet OAM frame.
MEP       Maintenance End Point is responsible for origination
          and termination of OAM frames for a given MEG
MIP       Maintenance Intermediate Point is located between peer
          MEPs and can process OAM frames but does not initiate
          or terminate them
RDI       Remote Defect Indication

Further, this document also uses the terminology and conventions
used in [PW-OAM-MSG-MAP].


3. PW Status and Defects

[PW-OAM-MSG-MAP] introduces a range of defects that impact PW
status. All these defect conditions are applicable for Ethernet PWs.



Mohan, et. al.         Expires: May 2008                   [Page 5]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

Similarly, there are different mechanisms described in [PW-OAM-MSG-
MAP] to detect PW defects, depending on the PSN type (e.g. MPLS PSN,
MPLS-IP PSN). Any of these mechanisms can be used when monitoring
the state of Ethernet PWs.  [PW-OAM-MSG-MAP] also discusses the
applicability of these failure detection mechanisms.

3.1 Use of Native Service notification

There is no NS fault notification capability currently specified for
Ethernet PWs. However, with the completion of Ethernet OAM work,
this capability can be added. This includes the ability to create a
MEP associated with the Ethernet PW on the PE. The native service
notification options include:

- AIS Frames sent by the MEP to the peer MEP on the other PE when
the MEP needs to convey PE forward defects, and when CCM
transmission is configured not to be turned ON.
- Suspension of CCM frames transmission from the MEP to the peer MEP
on the other PE to convey PE forward defects, when CCM
transmission is configured to be turned ON.
- RDI in transmitted CCM frames, when loss of CCMs from the peer MEP
is detected or PE needs to convey PW reverse defects.

These NS OAM notifications are inserted into the corresponding PW.

Similarly, when the defect conditions are cleared, a PE can take one
of the following actions, depending on the mechanism that was used
for failure notification, to clear the defect sate on the peer PE:

- Stop AIS Frame transmission from the MEP to the peer MEP on the
other PE to clear PW forward defects;
- Resuming CCM frames transmission from the MEP to the peer MEP to
clear PW forward defects notification, when CCM transmission is
configured to be turned ON.
- Clearing RDI indication in transmitted CCM frames, to clear PW
reverse defects notification.


3.2 Use of PW Status notification for MPLS PSNs

When PWs are established using LDP, LDP status notification
signaling SHOULD be used as the default mechanism to signal AC and
PW status and defects [RFC4447]. For PWs established over an MPLS or
MPLS-IP PSN using other mechanisms (e.g. static configuration),
inband signaling using VCCV-BFD [VCCV] SHOULD be used to convey AC
and PW status and defects.

[PW-OAM-MSG-MAP] identifies the following PW defect status
codepoints:
- Forward defect: corresponds to a logical OR of local AC (ingress)
Receive fault AND local PSN-facing PW (egress) transmit fault.
- Reverse defect: corresponds to a logical OR of local AC (egress)
transmit fault and local PW PSN-facing (ingress) receive fault.


Mohan, et. al.         Expires: May 2008                   [Page 6]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007


There are also scenarios where a PE carries out PW label withdrawal
instead of PW status notification. These include administrative
disablement of the PW or loss of Target LDP session with the peer
PE.


3.3 Use of BFD Diagnostic Codes

When using VCCV, the control channel (CC) type and Connectivity
Verification (CV) Type are agreed on between the peer PEs using the
OAM capability sub-TLV signaled as part of the interface parameter
TLV when using FEC 129 and the interface parameter sub-TLV when
using FEC 128.

As defined in [PW-OAM-MSG-MAP], when CV type of 0x04 is used to
indicate that BFD is used for PW fault detection only, PW defect is
detected via the BFD session while other defects, such as AC defects
or PE internal defects preventing it from forwarding traffic, are
communicated via LDP Status notification message in MPLS and MPLS-IP
PSN or other mechanisms in L2TP-IP PSN.

Similarly, when CV type of 0x08 is used to indicate that BFD is used
for both PW fault detection and AC/PW Fault Notification, all
defects are signaled via BFD.


4. Ethernet AC Defect States Entry or Exit Criteria

4.1 AC Forward Defect State Entry or Exit

PE1 enters the AC forward defect state if any of the following
conditions are met:

- It detects or is notified of a physical layer fault on the
Ethernet interface
- A MEP associated with the local AC receives an Ethernet AIS frame.
- A MEP associated with the local AC does not receive CCM frames
from the peer MEP in the client domain (e.g. CE1) within a
configurable interval equal to a multiple (e.g. 3.5) of the CCM
transmission period configured for the MEP. This is the case when
CCM transmission is configured to be turned ON.

PE1 exits the AC forward defect state if all of the conditions that
resulted in entering the defect state are cleared. This includes,
all of the following conditions:

- Any physical layer fault on the Ethernet interface, if detected or
notified previously, is removed
- A MEP associated with the local AC does not receive any Ethernet
AIS frame within a period indicated by previously received AIS,
if AIS was resulted in entering the defect state.


Mohan, et. al.         Expires: May 2008                   [Page 7]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

- A MEP associated with the local AC and configured with CCM
transmission on receives a configured number (e.g. 3 or more) of
consecutive CCM frames from the peer MEP on CE1 within an interval
equal to a multiple (e.g. 3.5) of the CCM transmission period
configured for the MEP.


4.2 AC Reverse Defect State Entry or Exit

PE1 enters the AC reverse defect state if the following condition is
met:

- A MEP configured with CCM transmission turned ON and associated
with the local AC receives a CCM frame, with its RDI bit set, from
peer MEP in the client domain (e.g. CE1).

PE1 exits the AC reverse defect state if the following condition is
met:

- A MEP configured with CCM transmission turned ON and associated
with the local AC does not receive a CCM frame with RDI bit set,
having received a previous CCM frame with RDI bit set from the
peer MEP in the client domain (e.g. CE1).


5. Ethernet AC and PW Defect States Interworking

5.1 PW Forward Defect Entry Procedures

When the PW status on PE1 transitions from working to PW forward
defect state; PE1's ability to receive user traffic from CE2 is
impacted. As a result, PE1 needs to notify CE1 about this problem.

Upon entry to the PW Forward Defect State, the following must be
done:

- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is not configured to be turned ON, the MEP
associated with the AC must transmit AIS frames periodically to the
peer MEP in the client domain (e.g. on CE1) based on configured AIS
transmission period.

- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, and the MEP
associated with the AC is configured to support Interface Status TLV
in CCM messages, the MEP associated with the AC must transmit CCM
frames with Interface Status TLV as being down to the peer MEP in
the client domain (e.g. on CE1).

- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, and the MEP
associated with the AC is configured to not support Interface Status
TLV in CCM messages, the MEP associated with the AC must stop


Mohan, et. al.         Expires: May 2008                   [Page 8]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

transmitting CCM frames to the peer MEP in the client domain (e.g.
on CE1).

Further, when PE1 enters the forward defect state, it must assume
that PE2 has no knowledge of the defect and must send reverse defect
failure notification to PE2. For MPLS PSN or MPLS-IP PSN, this is
done via either a PW Status notification message indicating a
reverse defect; or via VCCV-BFD diagnostic code of reverse defect if
VCCV CV type of 0x08 had been negotiated. When Native Service OAM
mechanism is supported on PE, it can also use the NS OAM
notification as specified in Section 3.1.

If PW forward defect is entered as a result of a forward defect
notification from PE2 or via loss of control adjacency, no
additional action is needed.


5.2 PW Forward Defect Exit Procedures

When the PW status transitions from PW forward defect state to
working, PE1's ability to receive user traffic from CE2 is restored.
As a result, PE1 needs to cease defect notification to CE1 by
performing the following:


- If PE1 is configured with a a MEP associated with the local AC and
CCM transmission is not configured to be turned ON, the MEP
associated with the AC must stop transmitting AIS frames towards the
peer MEP in the client domain (e.g. on CE1).

- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, and the MEP
associated with the AC is configured to support Interface Status TLV
in CCM messages, the MEP associated with the AC must transmit CCM
frames with Interface Status TLV as being Up to the peer MEP in the
client domain (e.g. on CE1).

- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, and the MEP
associated with the AC is configured to not support Interface Status
TLV in CCM messages, the MEP associated with the AC must resume
transmitting CCM frames to the peer MEP in the client domain (e.g.
on CE1).

Further, if the PW forward defect was explicitly detected by PE1, it
must now notify PE2 about clearing of forward defect state by
clearing reverse defect notification. For PWs over MPLS PSN or MPLS-
IP PSN, this is either done via PW Status message indicating
working; or via VCCV-BFD diagnostic code if VCCV CV type of 0x08 had
been negotiated. When Native Service OAM mechanism is supported on
PE, it can also clear the NS OAM notification specified in Section
3.1.



Mohan, et. al.         Expires: May 2008                   [Page 9]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

If PW forward defect was established via notification from PE2 or
via loss of control adjacency, no additional action is needed, since
PE2 is expected to be also aware of the defect clearing.


5.3 PW Reverse Defect Entry Procedures

When the PW status transitions from working to PW reverse defect
state, PE1's ability to transmit user traffic to CE2 is impacted. As
a result, PE needs to notify CE1 about this problem which has been
detected by PE1.

Upon entry to the PW Reverse Defect State, the following must be
done:

- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, the MEP associated
with the AC must set the RDI bit in transmitted CCM frames sent to
the peer MEP in the client domain (e.g. on CE1).


5.4 PW Reverse Defect Exit Procedures

When the PW status transitions from PW reverse defect state to
working, PE1's ability to transmit user traffic to CE2 is restored.
As a result, PE1 needs to cease defect notifications to CE1 and
perform the following


- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, the MEP associated
with the AC must clear the RDI bit in the transmitted CCM frames to
the peer MEP (e.g. on CE1).


5.5 AC Forward Defect Entry Procedures

When AC status transitions from working to AC Forward defect, PE1's
ability to receive user traffic from CE1 is impacted. As a result,
PE1 needs to notify PE2 and CE1 about this problem.

If the AC Forward defect is detected by PE1, it must notify PE2 in
the form of a forward defect notification.

When NS OAM is not supported on PE1, and for PW over MPLS PSN or
MPLS-IP PSN, forward defect notification is done via either PW
Status message indicating a forward defect or via VCCV-BFD
diagnostic code of forward defect if VCCV CV type of 0x08 had been
negotiated.

When Native Service OAM mechanism is supported on PE1, it can also
use the NS OAM notification as specified in Section 3.1.



Mohan, et. al.         Expires: May 2008                  [Page 10]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

In addition to above actions, PE1 must perform the following:

- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, the MEP associated
with AC must set the RDI bit in transmitted CCM frames.


5.6 AC Forward Defect Exit Procedures

When AC status transitions from AC Forward defect to working, PE1's
ability to receive user traffic from CE1 is restored. As a result,
PE1 needs to cease defect notifications to PE2 and CE1 and perform
the following:


- When NS OAM is not supported on PE1 and for PW over MPLS PSN or
MPLS-IP PSN, forward defect notification is cleared via PW Status
message indicating a working state; or via VCCV-BFD diagnostic code
if VCCV CV type of 0x08 had been negotiated.

- When Native Service OAM mechanism is supported on PE1, PE1 clears
the NS OAM notification as specified in Section 3.1.


- If PE1 is configured with a MEP associated with the local AC and
CCM transmission is configured to be turned ON, the MEP associated
with the AC must clear the RDI bit in transmitted CCM frames to the
peer MEP in the client domain (e.g. on CE1).


5.7 AC Reverse Defect Entry Procedures

When AC status transitions from working to AC Reverse defect, PE1's
ability to transmit user traffic to CE1 is impacted. As a result,
PE1 needs to notify PE2 about this problem.

If the AC Reverse defect is detected by PE1, it must notify PE2 in
the form of a reverse defect notification.

When NS OAM is not supported on PE, in PW over MPLS PSN or MPLS-IP
PSN, reverse defect notification is either done via PW Status
message indicating a reverse defect; or via VCCV-BFD diagnostic code
of reverse defect if VCCV CV type of 0x08 had been negotiated.

When Native Service OAM mechanism is supported on PE, it can also
use the NS OAM notification as specified in Section 3.1.


5.8 AC Reverse Defect Exit Procedures

When AC status transitions from AC Reverse defect to working, PE's
ability to transmit user traffic to CE1 is restored. As a result,
PE1 needs to clear notification to PE2.


Mohan, et. al.         Expires: May 2008                  [Page 11]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007


If the AC Reverse defect is cleared, PE1 must clear reverse defect
notification to PE2.

When NS OAM is not supported on PE1 and for PW over MPLS PSN or
MPLS-IP PSN, reverse defect notification is cleared via either a PW
Status message indicating a working state or via VCCV-BFD diagnostic
code of if VCCV CV type of 0x08 had been negotiated.

When Native Service OAM mechanism is supported on PE1, PE1 can clear
NS OAM notification as specified in Section 3.1.


6. Acknowledgments

To be completed.


7. IANA Considerations

This document has no actions for IANA.


8. Security Considerations

This document does not impose any security concerns since it makes
use of existing OAM mechanisms and mapping of these messages does
not change inherent security features.


9. References

9.1 Normative References

[Y.1731] "OAM Functions and mechanisms for Ethernet based networks",
ITU-T Y.1731, May 2006

[802.1ag] "Connectivity Fault Management", IEEE 802.1ag/D8.1, Jul
2007

[RFC4447] "Pseudowire Setup and Maintenance using LDP", RFC4447,
April 2006


9.2 Informative References

[RFC3985] "Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture",
RFC 3985, Mar 2005

[PW-OAM-MSG-MAP] "Pseudo Wire (PW) OAM Message Mapping", draft-ietf-
pwe3-oam-msp-map-05.txt, Work in progress, Mar 2007



Mohan, et. al.         Expires: May 2008                  [Page 12]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

[VCCV] "Pseudo Wire Virtual Circuit Connection Verification (VCCV)",
draft-ietf-pwe3-vccv-15.txt, Work in progress, Sep 2007

[MS-PW-ARCH] "An Architecture for Multi-Segment Pseudo Wire Edge-to-
Edge, draft-ietf-pwe3-ms-pw-arch-03.txt, Work in progress, Jun 2007

Appendix A: Ethernet Native Service Management

Ethernet OAM mechanisms are broadly classified into two categories:
Fault Management (FM) and Performance Monitoring (PM). ITU-T Y.1731
provides coverage for both FM and PM while IEEE 802.1ag provides
coverage for a sub-set of FM functions.

Ethernet OAM also introduces the concept of Maintenance Entity (ME)
which is used to identify the entity that needs to be managed. A ME
is inherently a point-to-point association. However, in case of a
multipoint association, Maintenance Entity Group (MEG) consisting of
different MEs is used. IEEE 802.1 uses the concept of Maintenance
Association (MA) which is used to identify both point-to-point and
multipoint associations. Each MA consists of Maintenance End Points
(MEPs) which are responsible for originating OAM frames. In between
the MEPs, there can also be Maintenance Intermediate Points (MIPs)
which do not originate OAM frames however do respond to OAM frames
from MEPs.

Ethernet OAM allows for hierarchical maintenance entities to allow
for simultaneous end-to-end and segment monitoring. This is achieved
by having a provision of up to 8 Maintenance Domain Levels (MD
Levels) where each MEP or MIP is associated with a specific MD
Level.

It is important to note that the common set of FM mechanisms between
IEEE 802.1ag and ITU-T Y.1731 are completely compatible.

The common FM mechanisms include:

1) Continuity Check Messages (CCM)
2) Loopback Message (LBM) and Loopback Reply (LBR)
3) Linktrace Message (LTM) and Linktrace Reply (LTR)

CCM messages are used for fault detection including misconnections
and mis-configurations. Typically CCM messages are sent as multicast
frames or Unicast frames and also allow RDI notifications. LBM/LBR
are used to perform fault verification, while also allow for MTU
verification and CIR/EIR measurements. LTM/LTR can be used for
discovering the path traversed between a MEP and another target
MIP/MEP in the same MA. LTM/LTR also allow for fault localization.

In addition, ITU-T Y.1731 also specifies the following FM functions:

4) Alarm Indication Signal (AIS)

AIS allows for fault notification to downstream and upstream nodes.


Mohan, et. al.         Expires: May 2008                  [Page 13]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007


Further, ITU-T Y.1731 also specifies the following PM functions:

5) Loss Measurement Message (LMM) and Reply (LMR)
6) Delay Measurement Message (DMR) and Reply (DMR)
7) 1-way Delay Message (1DM)

While LMM/LMR is used to measure Frame Loss Ratio (FLR), DMM/DMR is
used to measure single-ended (aka two-way) Frame Delay (FD) and
Frame Delay Variation (FDV, also known as Jitter). 1DM can be used
for dual-ended (aka one-way) FD and FDV measurements.


Authors' Addresses

Dinesh Mohan
Nortel
3500 Carling Ave
Ottawa, ON K2H8E9
Email: mohand@nortel.com

Nabil Bitar
Verizon Communications
Email : nabil.n.bitar@verizon.com

Simon Delord
Uecomm
658 Church St
Richmond, VIC, 3121, Australia
E-mail: sdelord@uecomm.com.au

Philippe Niger
France Telecom
2 av. Pierre Marzin
22300 LANNION, France
E-mail: philippe.niger@francetelecom.com


Full Copyright Statement

Copyright (C) The IETF Trust (2007).

This document is subject to the rights, licenses and restrictions
contained in BCP 78, and except as set forth therein, the authors
retain all their rights.

This document and the information contained herein are provided on
an "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE
REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE
IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL
WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY
WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE


Mohan, et. al.         Expires: May 2008                  [Page 14]
Internet-Draft    MPLS & Ethernet OAM Interworking         Nov 2007

ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS
FOR A PARTICULAR PURPOSE.


Intellectual Property

The IETF takes no position regarding the validity or scope of any
Intellectual Property Rights or other rights that might be claimed
to pertain to the implementation or use of the technology described
in this document or the extent to which any license under such
rights might or might not be available; nor does it represent that
it has made any independent effort to identify any such rights.
Information on the procedures with respect to rights in RFC
documents can be found in BCP 78 and BCP 79.

Copies of IPR disclosures made to the IETF Secretariat and any
assurances of licenses to be made available, or the result of an
attempt made to obtain a general license or permission for the use
of such proprietary rights by implementers or users of this
specification can be obtained from the IETF on-line IPR repository
at http://www.ietf.org/ipr.

The IETF invites any interested party to bring to its attention any
copyrights, patents or patent applications, or other proprietary
rights that may cover technology that may be required to implement
this standard.  Please address the information to the IETF at ietf-
ipr@ietf.org.



